open import Agda.Builtin.Cubical.Path
open import Cubical.Foundations.Prelude hiding (Type; _,_; cong; cong₂; cong₃) renaming (_∙_ to trans)


open import LaterPrims
open import Helper
open import Term
open import Renaming
open import Substitution
open import Denotation.LaterAlgebra
open import Denotation.Interpretation

-- The denotation of an expression after substitution/renaming under an interpretation of a context
-- is equivalent to
-- the denotation of the expression computed under the substituted/renamed interpretation of the context
module Denotation.RenSub where

infixl 9 _ᶜ⟪_⟫
infixl 9 _ᶜ⟪_⟫ˢ
infix 10 _ᶜ⟪_⟫⟨_⟩ᵉ
infix 10 _ᶜ⟪_⟫ˢ⟨_⟩ᵉ
infix 10 rename-⟦_⟧
infix 10 subst-⟦_⟧

-- interaction between Renaming _⟪_⟫ and denotation interpretation ⟦_⟧.

_ᶜ⟪_⟫ : Renaming Γ Δ → ⟦ Δ ⟧c → ⟦ Γ ⟧c
∅ ᶜ⟪ γ ⟫ = ∅
(x ∷ ρ) ᶜ⟪ γ ⟫ = γ ⟨ x ⟩ᵉ ∷ ρ ᶜ⟪ γ ⟫

_ᶜ⟪_⟫⟨_⟩ᵉ : (ρ : Renaming Γ Δ) (γ : ⟦ Δ ⟧c) (n : Γ ∋ τ)
          → ρ ᶜ⟪ γ ⟫ ⟨ n ⟩ᵉ ≡ γ ⟨ ρ ⟨ n ⟩ ⟩ᵉ
(x ∷ ρ) ᶜ⟪ γ ⟫⟨ Z ⟩ᵉ =
    (x ∷ ρ) ᶜ⟪ γ ⟫ ⟨ Z ⟩ᵉ
        ≡⟨⟩
    (γ ⟨ x ⟩ᵉ ∷ ρ ᶜ⟪ γ ⟫) ⟨ Z ⟩ᵉ
        ≡⟨⟩
    γ ⟨ x ⟩ᵉ
        ≡⟨⟩
    γ ⟨ (x ∷ ρ) ⟨ Z ⟩ ⟩ᵉ ∎
(x ∷ ρ) ᶜ⟪ γ ⟫⟨ S n ⟩ᵉ =
    (x ∷ ρ) ᶜ⟪ γ ⟫ ⟨ S n ⟩ᵉ
        ≡⟨⟩
    (γ ⟨ x ⟩ᵉ ∷ ρ ᶜ⟪ γ ⟫) ⟨ S n ⟩ᵉ
        ≡⟨⟩
    ρ ᶜ⟪ γ ⟫ ⟨ n ⟩ᵉ
        ≡⟨ ρ ᶜ⟪ γ ⟫⟨ n ⟩ᵉ ⟩
    γ ⟨ ρ ⟨ n ⟩ ⟩ᵉ
        ≡⟨⟩
    γ ⟨ (x ∷ ρ) ⟨ S n ⟩ ⟩ᵉ ∎


suc-renaming-ᶜ⟪-∷-⟫ : (ρ : Renaming Γ Δ) (γ : ⟦ Δ ⟧c) (α : ⟦ τ ⟧t)
                    → ρ ᶜ⟪ γ ⟫ ≡ suc-renaming ρ ᶜ⟪ α ∷ γ ⟫
suc-renaming-ᶜ⟪-∷-⟫ ∅ γ α = refl
suc-renaming-ᶜ⟪-∷-⟫ (x ∷ ρ) γ α = cong (γ ⟨ x ⟩ᵉ ∷_) (suc-renaming-ᶜ⟪-∷-⟫ ρ γ α)

ext-ᶜ⟪-∷-⟫ : (ρ : Renaming Γ Δ) (γ : ⟦ Δ ⟧c) (α : ⟦ τ ⟧t) → α ∷ (ρ ᶜ⟪ γ ⟫) ≡ ext ρ ᶜ⟪ α ∷ γ ⟫
ext-ᶜ⟪-∷-⟫ ρ γ α = cong (α ∷_) (suc-renaming-ᶜ⟪-∷-⟫ ρ γ α)

rename-idᶜ⟪_⟫ : (γ : ⟦ Γ ⟧c) → idᴿ Γ ᶜ⟪ γ ⟫ ≡ γ
rename-idᶜ⟪ ∅ ⟫ = refl
rename-idᶜ⟪ α ∷ γ ⟫ =
    idᴿ _ ᶜ⟪ α ∷ γ ⟫
        ≡⟨⟩
    (Z ∷ suc-renaming (idᴿ _)) ᶜ⟪ α ∷ γ ⟫
        ≡⟨⟩
    (α ∷ γ) ⟨ Z ⟩ᵉ ∷ suc-renaming (idᴿ _) ᶜ⟪ α ∷ γ ⟫
        ≡⟨⟩
    α ∷ suc-renaming (idᴿ _) ᶜ⟪ α ∷ γ ⟫
        ≡⟨ cong (α ∷_) (sym (suc-renaming-ᶜ⟪-∷-⟫ (idᴿ _) γ α)) ⟩
    α ∷ idᴿ _ ᶜ⟪ γ ⟫
        ≡⟨ cong (α ∷_) rename-idᶜ⟪ γ ⟫ ⟩
    α ∷ γ ∎


rename-⟦_⟧ :  (e : Γ ⊢ τ) (ρ : Renaming Γ Δ) (γ : ⟦ Δ ⟧c)
           → ⟦ e ⟧ (ρ ᶜ⟪ γ ⟫) ≡ ⟦ ρ ⟪ e ⟫ ⟧ γ
rename-⟦ var n ⟧ ρ γ = ρ ᶜ⟪ γ ⟫⟨ n ⟩ᵉ
rename-⟦ f ∙ t ⟧ ρ γ  = cong₂ (λ [f] [t] → [f] [t]) (rename-⟦ f ⟧ ρ γ) (rename-⟦ t ⟧ ρ γ)
rename-⟦ abs e ⟧ ρ γ = funExt (λ α →
        ⟦ abs e ⟧ (ρ ᶜ⟪ γ ⟫) α
            ≡⟨⟩
        ⟦ e ⟧ (α ∷ ρ ᶜ⟪ γ ⟫)
            ≡⟨ cong ⟦ e ⟧ (ext-ᶜ⟪-∷-⟫ ρ γ α) ⟩
        ⟦ e ⟧ (ext ρ ᶜ⟪ α ∷ γ ⟫)
            ≡⟨ rename-⟦ e ⟧ (ext ρ) (α ∷ γ) ⟩
        ⟦ ext ρ ⟪ e ⟫ ⟧ (α ∷ γ)
            ≡⟨⟩
        ⟦ ρ ⟪ abs e ⟫ ⟧ γ α ∎)
rename-⟦ # n ⟧ ρ γ = refl
rename-⟦ pred e ⟧ ρ γ = cong (𝓛-map nat-pred) (rename-⟦ e ⟧ ρ γ)
rename-⟦ succ e ⟧ ρ γ = cong (𝓛-map nat-succ) (rename-⟦ e ⟧ ρ γ)
rename-⟦ ifz e then t₀ else t₁ ⟧ ρ γ = cong₃ (λ [e] [0] [1] → map-ext ▹alg' (nat-ifz [0] [1]) [e])
                                             (rename-⟦ e ⟧ ρ γ) (rename-⟦ t₀ ⟧ ρ γ) (rename-⟦ t₁ ⟧ ρ γ)
rename-⟦ Y f ⟧ ρ γ = cong (λ [f] → gfix (λ x → θ' (next [f] ⊛ x))) (rename-⟦ f ⟧ ρ γ)

suc-rename-idᴿ⟦_⟧ : (t : Γ ⊢ τ) (γ : ⟦ Γ ⟧c) (α : ⟦ τ₁ ⟧t) → ⟦ suc-renaming (idᴿ _) ⟪ t ⟫ ⟧ (α ∷ γ) ≡ ⟦ t ⟧ γ
suc-rename-idᴿ⟦ t ⟧ γ α = sym (
    ⟦ t ⟧ γ
        ≡⟨ cong ⟦ t ⟧ (sym rename-idᶜ⟪ γ ⟫) ⟩
    ⟦ t ⟧ (idᴿ _ ᶜ⟪ γ ⟫)
        ≡⟨ cong ⟦ t ⟧ (suc-renaming-ᶜ⟪-∷-⟫ (idᴿ _) γ α) ⟩
    ⟦ t ⟧ (suc-renaming (idᴿ _) ᶜ⟪ α ∷ γ ⟫)
        ≡⟨ rename-⟦ t ⟧ (suc-renaming (idᴿ _)) (α ∷ γ) ⟩
    ⟦ suc-renaming (idᴿ _) ⟪ t ⟫ ⟧ (α ∷ γ) ∎)


-- interaction between Substitution _⟪_⟫ˢ and denotation interpretation ⟦_⟧.

_ᶜ⟪_⟫ˢ : Subst Γ Δ → ⟦ Δ ⟧c → ⟦ Γ ⟧c
∅ ᶜ⟪ γ ⟫ˢ = ∅
(t ∷ σ) ᶜ⟪ γ ⟫ˢ = ⟦ t ⟧ γ ∷ σ ᶜ⟪ γ ⟫ˢ

_ᶜ⟪_⟫ˢ⟨_⟩ᵉ : (σ : Subst Γ Δ) (γ : ⟦ Δ ⟧c) (n : Γ ∋ τ)
           → σ ᶜ⟪ γ ⟫ˢ ⟨ n ⟩ᵉ ≡ ⟦ σ ⟨ n ⟩ˢ ⟧ γ
(t ∷ σ) ᶜ⟪ γ ⟫ˢ⟨ Z ⟩ᵉ =
    (t ∷ σ) ᶜ⟪ γ ⟫ˢ ⟨ Z ⟩ᵉ
        ≡⟨⟩
    (⟦ t ⟧ γ ∷ σ ᶜ⟪ γ ⟫ˢ) ⟨ Z ⟩ᵉ
        ≡⟨⟩
    ⟦ t ⟧ γ
        ≡⟨⟩
    ⟦ (t ∷ σ) ⟨ Z ⟩ˢ ⟧ γ ∎
(t ∷ σ) ᶜ⟪ γ ⟫ˢ⟨ S n ⟩ᵉ =
    (t ∷ σ) ᶜ⟪ γ ⟫ˢ ⟨ S n ⟩ᵉ
        ≡⟨⟩
    (⟦ t ⟧ γ ∷ σ ᶜ⟪ γ ⟫ˢ) ⟨ S n ⟩ᵉ
        ≡⟨⟩
    σ ᶜ⟪ γ ⟫ˢ ⟨ n ⟩ᵉ
        ≡⟨ σ ᶜ⟪ γ ⟫ˢ⟨ n ⟩ᵉ ⟩
    ⟦ σ ⟨ n ⟩ˢ ⟧ γ
        ≡⟨⟩
    ⟦ (t ∷ σ) ⟨ S n ⟩ˢ ⟧ γ ∎



suc-subst-ᶜ⟪-∷-⟫ˢ : (σ : Subst Γ Δ) (γ : ⟦ Δ ⟧c) (α : ⟦ τ ⟧t)
                 → σ ᶜ⟪ γ ⟫ˢ ≡ suc-subst σ ᶜ⟪ α ∷ γ ⟫ˢ
suc-subst-ᶜ⟪-∷-⟫ˢ ∅ γ α = refl
suc-subst-ᶜ⟪-∷-⟫ˢ (t ∷ σ) γ α =
    (t ∷ σ) ᶜ⟪ γ ⟫ˢ
        ≡⟨⟩
    ⟦ t ⟧ γ ∷ σ ᶜ⟪ γ ⟫ˢ
        ≡⟨ cong (_∷ σ ᶜ⟪ γ ⟫ˢ) (sym (suc-rename-idᴿ⟦ t ⟧ γ α)) ⟩
    ⟦ suc-renaming (idᴿ _) ⟪ t ⟫ ⟧ (α ∷ γ) ∷ σ ᶜ⟪ γ ⟫ˢ
        ≡⟨ cong (⟦ suc-renaming (idᴿ _) ⟪ t ⟫ ⟧ (α ∷ γ) ∷_) (suc-subst-ᶜ⟪-∷-⟫ˢ σ γ α) ⟩
    ⟦ suc-renaming (idᴿ _) ⟪ t ⟫ ⟧ (α ∷ γ) ∷ suc-subst σ ᶜ⟪ α ∷ γ ⟫ˢ
        ≡⟨⟩
    (suc-renaming (idᴿ _) ⟪ t ⟫ ∷ suc-subst σ) ᶜ⟪ α ∷ γ ⟫ˢ
        ≡⟨⟩
    suc-subst (t ∷ σ) ᶜ⟪ α ∷ γ ⟫ˢ ∎

exts-ᶜ⟪-∷-⟫ˢ : (σ : Subst Γ Δ) (γ : ⟦ Δ ⟧c) (α : ⟦ τ ⟧t) → α ∷ (σ ᶜ⟪ γ ⟫ˢ) ≡ exts σ ᶜ⟪ α ∷ γ ⟫ˢ
exts-ᶜ⟪-∷-⟫ˢ σ γ α = cong (α ∷_) (suc-subst-ᶜ⟪-∷-⟫ˢ σ γ α)

subst-⟦_⟧ :  (e : Γ ⊢ τ) (σ : Subst Γ Δ) (γ : ⟦ Δ ⟧c)
          → ⟦ e ⟧ (σ ᶜ⟪ γ ⟫ˢ) ≡ ⟦ σ ⟪ e ⟫ˢ ⟧ γ
subst-⟦ var n ⟧ σ γ = σ ᶜ⟪ γ ⟫ˢ⟨ n ⟩ᵉ
subst-⟦ f ∙ t ⟧ σ γ  = cong₂ (λ [f] [t] → [f] [t]) (subst-⟦ f ⟧ σ γ) (subst-⟦ t ⟧ σ γ)
subst-⟦ abs e ⟧ σ γ = funExt (λ α →
        ⟦ abs e ⟧ (σ ᶜ⟪ γ ⟫ˢ) α
            ≡⟨⟩
        ⟦ e ⟧ (α ∷ σ ᶜ⟪ γ ⟫ˢ)
            ≡⟨ cong ⟦ e ⟧ (exts-ᶜ⟪-∷-⟫ˢ σ γ α) ⟩
        ⟦ e ⟧ (exts σ ᶜ⟪ α ∷ γ ⟫ˢ)
            ≡⟨ subst-⟦ e ⟧ (exts σ) (α ∷ γ) ⟩
        ⟦ exts σ ⟪ e ⟫ˢ ⟧ (α ∷ γ)
            ≡⟨⟩
        ⟦ σ ⟪ abs e ⟫ˢ ⟧ γ α ∎)
subst-⟦ # n ⟧ σ γ = refl
subst-⟦ pred e ⟧ σ γ = cong (𝓛-map nat-pred) (subst-⟦ e ⟧ σ γ)
subst-⟦ succ e ⟧ σ γ = cong (𝓛-map nat-succ) (subst-⟦ e ⟧ σ γ)
subst-⟦ ifz e then t₀ else t₁ ⟧ σ γ = cong₃ (λ [e] [0] [1] → map-ext ▹alg' (nat-ifz [0] [1]) [e])
                                             (subst-⟦ e ⟧ σ γ) (subst-⟦ t₀ ⟧ σ γ) (subst-⟦ t₁ ⟧ σ γ)
subst-⟦ Y f ⟧ σ γ = cong (λ [f] → gfix (λ x → θ' (next [f] ⊛ x))) (subst-⟦ f ⟧ σ γ)


subst-idᶜ⟪_⟫ˢ : (γ : ⟦ Γ ⟧c) → idˢ Γ ᶜ⟪ γ ⟫ˢ ≡ γ
subst-idᶜ⟪ ∅ ⟫ˢ = refl
subst-idᶜ⟪ α ∷ γ ⟫ˢ =
    idˢ _ ᶜ⟪ α ∷ γ ⟫ˢ
        ≡⟨⟩
    exts (idˢ _) ᶜ⟪ α ∷ γ ⟫ˢ
        ≡⟨ sym (exts-ᶜ⟪-∷-⟫ˢ (idˢ _) γ α) ⟩
    α ∷ (idˢ _ ᶜ⟪ γ ⟫ˢ)
        ≡⟨ cong (α ∷_) subst-idᶜ⟪ γ ⟫ˢ ⟩
    α ∷ γ ∎
